Поиск_вакансий_Сервер/src/Documents/Отклики/Отклики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Отклики</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗапланированныеВстречи</registerRecords>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыОткликов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезЧтоСвязались</name>
    <type>
      <types>EnumRef.КакВышлиНаМеня</types>
    </type>
  </attributes>
  <attributes>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Работодатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Метро</name>
    <type>
      <types>CatalogRef.СтанцииМетро</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаHR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКадровика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтклика</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаРезюме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаВРезюме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сфера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Франчайзи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезюмеМое</name>
    <type>
      <types>CatalogRef.МоиРезюме</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяСобеседования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаПроездаВПисьме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Поиск_вакансий_Сервер/src/InformationRegisters/ЗапланированныеВстречи/ЗапланированныеВстречи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапланированныеВстречи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ДатаИВремяСобеседования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Схема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтклика</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Поиск_вакансий_Сервер/src/Enums/СтатусОтклика/СтатусОтклика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусОтклика</name>
  <enumValues>
    <name>НовоеПриглашение</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрение</name>
  </enumValues>
  <enumValues>
    <name>НазначеноСобеседование</name>
  </enumValues>
  <enumValues>
    <name>ЖдуРезультатовСобеседования</name>
  </enumValues>
  <enumValues>
    <name>Отклонил</name>
  </enumValues>
  <enumValues>
    <name>ГотовыВзять</name>
  </enumValues>
  <enumValues>
    <name>НеГотовыВзять</name>
  </enumValues>
</mdclass:Enum>

Поиск_вакансий_Сервер/src/Documents/Отклики/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Попытка
	ВакансияК = Вакансия.ПолучитьОбъект();
	ВакансияК.БылОтклик = Истина;
	ВакансияК.Записать();
	Исключение
	КонецПопытки;
	
	
	Если Статус <> Перечисления.СтатусОтклика.НовоеПриглашение
	и Статус <> Перечисления.СтатусОтклика.Отклонил Тогда
	Движения.ЗапланированныеВстречи.Записывать = Истина;
	Движение = Движения.ЗапланированныеВстречи.Добавить();
	Движение.Период = Дата;
	Движение.Статус = Статус;
	Движение.ДатаИВремяСобеседования = ДатаИВремяСобеседования;
	Движение.Адрес = Адрес;
	Движение.Схема = СхемаПроездаВПисьме;
	Иначе
	Движения.ЗапланированныеВстречи.Очистить();
	Движения.ЗапланированныеВстречи.Записать();
	
	КонецЕсли;	
		

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗапланированныеВстречи

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
